_Rarzrabotki/Rarus/USO2/Documents/СМ_РазделЛокальнойСметы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СМ_РазделЛокальнойСметы</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидРабот</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИД</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДРодителя</Name>
					<Comment>Внутренний код</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСметы</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_ЛокальнаяСмета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КорректируетРаздел</Name>
					<Comment>Корректируемый раздел</Comment>
					<Type>
						<v8:Type>cfg:DocumentRef.СМ_РазделЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОборуд</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффОснЗарплаты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффПолнСтоимРабот</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЗарплатеМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимМатериалов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоэффСтоимЭксплМашин</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>8</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеДляПечати</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВДереве</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВПределахСметы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Раздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_РазделыЛокальнойСметы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Расчет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНРТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСПТекущая</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>20</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/CommonModules/СМ_ОбменСМобильнымСервер/Ext/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// Подсистема "Сметная подсистема".
// 
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

// Используется для подписки на событие ПриЗаписи, для регистрации сметы к переносу на мобильное устройство.
//
// Параметры:
//     Источник - Документобъект - документ, вызвавший событие.
//     Отказ - Истина - определяет продолжать запись или нет.
//
Процедура ПриЗаписиДляМобильногоПриЗаписи(Источник, Отказ) Экспорт
	
	Если ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_ЛокальнаяСмета") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.ссылка);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если МассивУзлов.Количество()>0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
			РегистрацияПозицийРазделов(МассивУзлов,Источник);
			Если ЗначениеЗаполнено(Источник.ссылка.ИДРодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.ссылка.ИДРодителя.Ссылка);
				Если ТипЗнч(Источник.ссылка.ИДРодителя) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
					Если ЗначениеЗаполнено(Источник.ссылка.ИДРодителя.ИДРодителя) Тогда
						ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.ссылка.ИДРодителя.ИДРодителя.Ссылка);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_ОбъектнаяСмета") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.ссылка);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
		Если МассивУзлов.Количество()>0 Тогда
			Если ЗначениеЗаполнено(Источник.ссылка.ИДРодителя) Тогда
				ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.ссылка.ИДРодителя.Ссылка);
			КонецЕсли;
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_СводнаяСмета") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.ссылка);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		Если МассивУзлов.Количество()>0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_ПозицияЛокальнойСметы") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.ИДСметы);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
		Если МассивУзлов.Количество()>0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.ИДСметы);
			РегистрацияПозицийРазделов(МассивУзлов,Источник.ИДСметы)
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_РазделЛокальнойСметы") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.ИДСметы);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
		Если МассивУзлов.Количество()>0 Тогда
			ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник.ИДСметы);
			РегистрацияПозицийРазделов(МассивУзлов,Источник.ИДСметы)
		КонецЕсли;
	ИначеЕсли ТипЗнч(Источник.Ссылка) = Тип("ДокументСсылка.СМ_АктВыполненныхРабот") Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.Ссылка
		|ИЗ
		|	ПланОбмена.СМ_ОбменСметаМобильное.ДокументыДляОбмена КАК СМ_ОбменСметаМобильноеДокументыДляОбмена
		|ГДЕ
		|	СМ_ОбменСметаМобильноеДокументыДляОбмена.ДокументОтбор = &Док";
		Запрос.УстановитьПараметр("Док",Источник.Ссылка);
		МассивУзлов = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Источник);
	КонецЕсли;
	
КонецПроцедуры

// Регистрирует все разделы и позиции сметы к переносу на мобильное.
// Вызывается при регистрации локальной сметы.
//
// Параметры:
//     МассивУзлов 	- Массив - содержит ссылки на узлы плана обмена (План обмена СМ_ОбменСметаМобильное).
//     Источник 	- ДокументОбъект.СМ_ЛокальнаяСмета, ДокументСсылка.СМ_ЛокальнаяСмета - источник регистрации.  
//
Процедура РегистрацияПозицийРазделов(МассивУзлов,Источник) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СМ_ПозицияЛокальнойСметы.Ссылка
	|ИЗ
	|	Документ.СМ_ПозицияЛокальнойСметы КАК СМ_ПозицияЛокальнойСметы
	|ГДЕ
	|	СМ_ПозицияЛокальнойСметы.ИДСметы = &ЛС
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	СМ_РазделЛокальнойСметы.Ссылка
	|ИЗ
	|	Документ.СМ_РазделЛокальнойСметы КАК СМ_РазделЛокальнойСметы
	|ГДЕ
	|	СМ_РазделЛокальнойСметы.ИДСметы = &ЛС";
	Запрос.УстановитьПараметр("ЛС",Источник.Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Выборка.Ссылка);
	КонецЦикла;
КонецПроцедуры

// Регистрирует все локальной сметы в составе объектной для обмена на мобильное устройство.
//
// Параметры:
//     МассивУзлов 	- Массив - содержит ссылки на узлы плана обмена (план обмена СМ_ОбменСметаМобильное).
//     Источник 	- ДокументОбъект.СМ_ЛокальнаяСмета, ДокументСсылка.СМ_ЛокальнаяСмета - источник регистрации.  
//
Процедура РегистрацияОС_ЛС(МассивУзлов,Источник) Экспорт
	Для каждого Смета Из Источник.ЛокальныеСметы Цикл
		ПланыОбмена.ЗарегистрироватьИзменения(МассивУзлов,Смета.ЛокальнаяСмета);
		РегистрацияПозицийРазделов(МассивУзлов,Смета.ЛокальнаяСмета)
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
